apps/backend/artillery/click.yml
config:
  target: "http://localhost:3300"
  phases:
    - duration: 10000
#      arrivalCount: 10000
      arrivalRate: 100
#      rampTo: 10
  processor: "./click-processor.ts"



scenarios:
  - name: Click
    flow:
      - get:
          beforeRequest: 'randomCode'
          url: /{{ randomCode }}